// Задача 1 Напишпте программу которая на вход принимает 2 числа и выдает, какое число большее а какое меньшее
Console.WriteLine("Первые два числа для проверки 5 и 7");
int a = 5;
int b = 7;
